In [1]:
#$conda activate py37
#(py37)$ jupyter notebook

In [2]:
# %config IPCompleter.greedy=True

In [3]:
#press [SHIFT] and [TAB] from within the method parentheses

### intellisense - works perfect!! -> excute in command line windows. : (py37) $ -> works perfect !!
# (py37) $pip3 install jupyter-tabnine
# (py37) $sudo jupyter nbextension install --py jupyter_tabnine

# (py37) $jupyter nbextension enable jupyter_tabnine --py
##### jupyter nbextension enable --py jupyter_tabnine ##instead above line excuted. 

# (py37) $jupyter serverextension enable --py jupyter_tabnine

#--> I installed in (py37) conda env.

# Getting Started with pandas
* pandas is designed for working with tabular or heterogeneous data. 
* NumPy, by contrast, is best suited for working with homogeneous numerical array data.

In [4]:
import pandas as pd

In [5]:
from pandas import Series, DataFrame

In [6]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

## Introduction to pandas Data Structures

### Series

In [7]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj.values

array([ 4,  7, -5,  3])

In [9]:
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [12]:
print(obj2['a'])
obj2['d'] = 6
obj2[['c', 'a', 'd']]

-5

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

Should you have data contained in a Python **dict**, you can create a Series from it by
passing the dict:

In [19]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [23]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

obj4.index.name = 'state'

In [25]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [26]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [27]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame
``` pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
                             ```

In [28]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [29]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [30]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [31]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [32]:
# pass a column('debt') not in dict -> NaN
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [33]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [34]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [35]:
# frame2['year'] 
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [36]:
#Rows can also be retrieved by position or name with the special loc attribute(for label) vs. iloc(for integer)
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [37]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [38]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [39]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [40]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2
#New columns cannot be created with the frame2.eastern syntax.

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [41]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [42]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [43]:
frame3 = pd.DataFrame(pop)
print(frame3.shape)
frame3

(3, 2)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [44]:
print(frame3.T.shape)
frame3.T

(2, 3)

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [45]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [46]:
#frame3['Ohio'][:-1] -> -1 not included
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [47]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [48]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [49]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

In [50]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [51]:
index = obj.index
print(index)
index[1:]

Index(['a', 'b', 'c'], dtype='object')

Index(['b', 'c'], dtype='object')

Index objects are immutable and thus can’t be modified by the user:

In [52]:
# index[1] = 'd'  # TypeError

TypeError: Index does not support mutable operations

In [53]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [54]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [55]:
obj2.index is labels

True

In [56]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [57]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [58]:
'Ohio' in frame3.columns

True

In [59]:
2003 in frame3.index

False

In [60]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Essential Functionality

### Reindexing

In [61]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [62]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [63]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [64]:
obj3.reindex(range(6), method='ffill') #if NaN, fill same as the previous

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [65]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [66]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [67]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [68]:
# frame

In [69]:
frame.loc[['a', 'b', 'c', 'd'], states]

/home/ys/anaconda3/envs/py37/lib/python3.7/site-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping Entries from an Axis

In [70]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [71]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [72]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [73]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [75]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [76]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

**drop** , which modify the size or shape of a Series or DataFrame,
can manipulate an object in-place without returning a new object:
* Be careful with the inplace , as it destroys any data that is dropped.

In [77]:
obj1 = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj1

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [78]:
obj1.drop('c', inplace=True) #in obj1, index 'c' disappeared
obj1

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [79]:
obj2 = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj2

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [80]:
obj2.drop('c') #in obj2, index 'c' exist
obj2

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection, and Filtering

In [81]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [82]:
obj['b']

1.0

In [83]:
obj[1]

1.0

In [84]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [85]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [86]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [87]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

Slicing with labels behaves differently than normal Python slicing in that the end‐
point is inclusive:

In [88]:
obj['b':'c'] #index 'c' included!(from index 'b' to index 'c')

b    1.0
c    2.0
dtype: float64

In [89]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [90]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [92]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [93]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [94]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [95]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [96]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc
* DataFrame label-indexing on the rows
* select a subset of the rows and columns from a DataFrame either axis labels ( loc ) or integers( iloc ).

In [97]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [99]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [100]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [101]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [102]:
data.loc[:'Utah', 'two'] # [:'Utah', '...' ] ->  'Utah' included

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [103]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Integer Indexes
* differences with indexing semantics on built-in Python data structures like lists and tuples.

In [104]:
#  Here we have an index containing 0, 1, 2,but inferring what the user wants 
# (label-based indexing(loc) or position-based(iloc)) is difficult:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [105]:
#ser[-1] #Series with integer index -> python : no error but pd causes KeyError

In [106]:
# On the other hand, with a non-integer index, there is no potential for ambiguity:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [107]:
ser2[-1] # Series with label index

2.0

To keep things consistent, if you have an **axis index containing integers**, data selection
will always be **label-oriented**
* For more precise handling, use loc (for labels) or iloc(for integers):
    * ser.loc[:1] #label indexing, including stop(:1) 
    * ser.iloc[:1] #integer indexing, not including stop(:1)

In [108]:
ser[:1]

0    0.0
dtype: float64

In [109]:
ser.loc[:1] #label indexing, including stop(:1)

0    0.0
1    1.0
dtype: float64

In [110]:
ser.iloc[:1] #integer indexing, not including stop(:1)

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [111]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [112]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [113]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [114]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [115]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [116]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [117]:
df1 = pd.DataFrame({'A': [1, 2]})
df1

   A
0  1
1  2

In [118]:
df2 = pd.DataFrame({'B': [3, 4]})
df2

   B
0  3
1  4

In [119]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values
* fill with a special value, like 0, when an axis label is found in one object but not the other:

In [120]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [121]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [122]:
df1 + df2 #5.0 + NaN -> NaN, '' + NaN -> NaN

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [123]:
df1.add(df2, fill_value=0) #fill_value=0 -> if NaN or not exist, fill 0 : (NaN in df2 or '' in df1) to 0

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [124]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

counterpart, starting with the letter r , that has arguments flipped(turned over). So these
two statements are equivalent:

In [125]:
df1.div(1)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [126]:
df1.rdiv(1) #flipped(turned over) division such as 1/0.0, 1/1.0, 1/2.0 ...

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [127]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### r : flipped(turned over) such as rdiv : filipped division such as 1/0.0, 1/1.0, 1/2.0 ...
|Function|Description|
|:-------|:----------|
|add, radd|+|
|sub, rsub|-|
|div, rdiv|/|
|floordiv, rfloordiv| Methods for floor division (//)|
|mul, rmul|*|
|pow, rpow|**|

#### Operations between DataFrame and Series(broadcasting to all rows)

1. Arithmetic between NumPy arrays of different dimensions

In [128]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [129]:
arr[0]

array([0., 1., 2., 3.])

In [130]:
#broadcasting to all rows: When we subtract arr[0] from arr , the subtraction is performed once for each row. same as below
# Arithmetic between DataFrame and Series
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

2. Arithmetic between DataFrame and Series

In [131]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [132]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [133]:
#broadcasting to all rows
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [134]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [135]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [136]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [137]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

The axis number that you pass is the axis to match on. In this case we mean to match
on the DataFrame’s row index ( axis='index' or axis=0 ) and broadcast across.

In [138]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [139]:
#test
frame_test = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame_test

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [140]:
series_test3 = frame_test['d']
series_test3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [141]:
frame_test.sub(series_test3)

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [142]:
frame_test.sub(series_test3, axis=0) #row-wise subtraction

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [143]:
frame_test.sub(series_test3, axis=1) #column wise subtraction

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

### Function Application and Mapping

In [144]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

1. NumPy ufuncs (element-wise array methods) also work with pandas objects: **np.abs(frame)**

In [145]:
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [146]:
frame.max()

b    1.246435
d    1.965781
e    1.393406
dtype: float64

In [147]:
frame.min()

b   -0.555730
d    0.281746
e   -1.296221
dtype: float64

In [148]:
frame.max() - frame.min()

b    1.802165
d    1.684034
e    2.689627
dtype: float64

2.  DataFrame’s **apply** method : applying a function on one-dimensional arrays to eachcolumn or row.

Here the function f , which computes the difference between the maximum and minimum of a Series, is invoked once on each column in frame . The result is a Series having the columns of frame as its index.
If you pass axis='columns' to apply , the function will be invoked once per row instead:

In [149]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [150]:
frame.apply(f, axis='columns')

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [151]:
# test1
pd.Series([np.arange(3), np.arange(4)], index=list('ab'))

a       [0, 1, 2]
b    [0, 1, 2, 3]
dtype: object

In [152]:
# test2
pd.Series([np.arange(4).min(), np.arange(4).max()], index=['min', 'max'])

min    0
max    3
dtype: int64

In [153]:
# test3
tests = pd.Series([frame.min(), frame.max()], index=['min', 'max'])
type(tests) #pandas.core.series.Series
tests

min    b   -0.555730
d    0.281746
e   -1.296221
dtyp...
max    b    1.246435
d    1.965781
e    1.393406
dtyp...
dtype: object

In [154]:
[frame.min(), frame.max()]

[b   -0.555730
 d    0.281746
 e   -1.296221
 dtype: float64, b    1.246435
 d    1.965781
 e    1.393406
 dtype: float64]

In [155]:
#test4
pd.DataFrame([frame.min(), frame.max()], index=['min', 'max'])

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

3. The function passed to apply need not return a scalar value; it can also return a Series with multiple values:

In [156]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

4. **applymap**  :Element-wise Python functions can be used, too. Suppose you wanted to compute a
formatted string from each floating-point value in frame.
 * The reason for the name **applymap** is that Series has a **map** method for applying an
element-wise function:

In [157]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [158]:
print(type(frame['e'])) #pandas.core.series.Series
print(frame['e'].name)
frame['e'].name = 'new_e'
frame['e'].map(format)

<class 'pandas.core.series.Series'>
e

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: new_e, dtype: object

### Sorting and Ranking
*frame.sort_index(inplace = True),frame.sort_values(inplace = True) : only change original frame DataFrame

In [159]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [160]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [161]:
frame.sort_index() #frame not changed
# frame.sort_index(inplace=True) #frame changed with inplace=True

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [162]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [163]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [164]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [165]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [166]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [167]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [168]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [169]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [170]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [171]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

* .rank() : data points in an array. same values -> mean of each value's position
* .rank(method='first') 
* .rank(ascending=False, method='max')

In [172]:
# by default rank breaks ties by assigning each group the mean rank(two '4 'in position(4, 5) -> mean 4.5 for all '4':
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [173]:
obj.rank(method='first') #.rank(method='first') -> first postion of same values

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [174]:
obj.rank(ascending=False, method='first')

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [175]:
# Assign tie values the maximum rank in the group
#[7, -5, 7, 4, 2, 0, 4] -> Make reference of the previous cell: 
# tow 7s (index 0,2) ranking 1,2 -> all 7s rank 2
# two 4s(index 3,6) ranking 3,4 -> all 4s rank 4
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [176]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [177]:
frame.rank(axis='columns') # index 0: 4.3, 0, -2.0 -> ranking 3,2,1

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [178]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [179]:
obj.index

Index(['a', 'a', 'b', 'b', 'c'], dtype='object')

In [180]:
obj.index.is_unique

False

In [181]:
obj['a']

a    0
a    1
dtype: int64

In [182]:
obj['c']

4

In [183]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [184]:
df.loc['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and Computing Descriptive Statistics

In [185]:
test_list  = np.array([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]])
print(test_list.shape)
test_list

(4, 2)

array([[ 1.4 ,   nan],
       [ 7.1 , -4.5 ],
       [  nan,   nan],
       [ 0.75, -1.3 ]])

In [186]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

NA values are excluded unless the entire slice (row or column in this case) is NA unless skipna=False

In [187]:
df.sum()  #row-wise sum

one    9.25
two   -5.80
dtype: float64

In [188]:
df.sum(axis='columns') #comumn-wise sum

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [189]:
df.mean(axis='columns') #index 'a' row -> NaN in columkn 'tow' excluded -> mean(1.4) -> 1.4

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [190]:
#skipna=False -> NaN included -> sum(1.40, NaN ) -> NaN
df.sum(axis='columns', skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [191]:
#skipna=False -> NaN included -> mean(1.40, NaN ) -> NaN
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

idxmin() and idxmax() , return indirect statistics like the index value
where the minimum or maximum values are attained:

In [192]:
df.idxmax() #each column's row-wise max value's index

one    b
two    d
dtype: object

In [193]:
df.idxmin()

one    d
two    b
dtype: object

In [194]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [195]:
df.cumsum(axis=1)

    one   two
a  1.40   NaN
b  7.10  2.60
c   NaN   NaN
d  0.75 -0.55

In [196]:
df.fillna(0).cumsum(axis=1)

    one   two
a  1.40  1.40
b  7.10  2.60
c  0.00  0.00
d  0.75 -0.55

In [197]:
# numeric data describe()
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [198]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [199]:
#non-numeric data, describe()
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [200]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### Descriptive and summary statistics
|Function|Description|
|:-------|:----------|
|argmin, argmax |Compute index locations (integers) at which minimum or maximum value obtained, respectively|
|idxmin, idxmax |Compute index labels at which minimum or maximum value obtained, respectively

### Correlation and Covariance

In [201]:
#DataFrames of stock prices and volumes obtained
# from Yahoo! Finance using the add-on pandas-datareader package.

# $conda activate py37
# (py37)$ conda install pandas-datareader  #already installed !

In [202]:
# !conda install pandas-datareader

In [228]:
price = pd.read_pickle('examples/yahoo_price.pkl')
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [229]:
volume = pd.read_pickle('examples/yahoo_volume.pkl')
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [232]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [233]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-01-15   98.148056  124.555489   40.830055   500.416107
2015-01-16   97.385445  126.626427   41.512352   506.688873
2015-01-20   99.893822  126.473312   41.647015   505.512115
2015-01-21  100.656441  122.557053   41.225071   516.621643
2015-01-22  103.275063  125.216255   42.311356   532.926819
...                ...         ...         ...          ...
2020-01-08  303.190002  135.309998  160.089996  1404.319946
2020-01-09  309.630005  136.740005  162.089996  1419.829956
2020-01-10  310.329987  136.690002  161.339996  1429.729980
2020-01-13  316.959991  136.600006  163.279999  1439.229980
2020-01-14  312.679993  135.759995  162.130005  1430.880005

[1258 rows x 4 columns]

In [234]:
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})
volume

                  AAPL         IBM        MSFT       GOOG
Date
2015-01-15  60014000.0   4248400.0  32750800.0  2715800.0
2015-01-16  78513300.0   5756000.0  35695300.0  2298200.0
2015-01-20  49899900.0   8392800.0  36161900.0  2232000.0
2015-01-21  48575900.0  11897100.0  39081100.0  2268700.0
2015-01-22  53796400.0   6120100.0  35898000.0  2676900.0
...                ...         ...         ...        ...
2020-01-08  33019800.0   4346000.0  27746500.0  1528000.0
2020-01-09  42527100.0   3730600.0  21385000.0  1500900.0
2020-01-10  35161200.0   3255400.0  20725900.0  1820700.0
2020-01-13  30383000.0   3531000.0  21626500.0  1652300.0
2020-01-14  39279958.0   2589136.0  21589170.0  1345408.0

[1258 rows x 4 columns]

In [235]:
returns = price.pct_change()
# returns = price.pct_change(fill_method='ffill') #fill NaN according to previous element.
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-01-08  0.016086  0.008346  0.015928  0.007880
2020-01-09  0.021241  0.010568  0.012493  0.011044
2020-01-10  0.002261 -0.000366 -0.004627  0.006973
2020-01-13  0.021364 -0.000658  0.012024  0.006645
2020-01-14 -0.013503 -0.006149 -0.007043 -0.005802

In [222]:
returns['MSFT'].corr(returns['IBM'])

0.48370890011973855

In [251]:
# stock_list = ['AAPL', 'IBM', 'MSFT', 'GOOG']
# for x in stock_list:
#     for y in stock_list:
#         if x != y:
#             print(f"correlations:{x}-{y} : {returns[x].corr(returns[y])}")

In [249]:
import itertools as it
for x, y in list(it.combinations(stock_list, 2)):
    print(f"correlations:{x}-{y} : {returns[x].corr(returns[y])}")

correlations:AAPL-IBM : 0.39721608161567457
correlations:AAPL-MSFT : 0.5732310008079922
correlations:AAPL-GOOG : 0.5244024422595729
correlations:IBM-MSFT : 0.48373115421668395
correlations:IBM-GOOG : 0.40984440740133454
correlations:MSFT-GOOG : 0.6603851539813503

In [223]:
returns['MSFT'].cov(returns['IBM'])

9.163877534686861e-05

In [224]:
returns.MSFT.corr(returns.IBM)

0.48370890011973855

In [225]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.397169  0.573211  0.524320
IBM   0.397169  1.000000  0.483709  0.409794
MSFT  0.573211  0.483709  1.000000  0.660344
GOOG  0.524320  0.409794  0.660344  1.000000

**COV**: Covariance provides the a measure of strength of correlation between two variable or more set of variables.
* If COV(xi, xj) = 0 then variables are uncorrelated
* If COV(xi, xj) > 0 then variables positively correlated
* If COV(xi, xj) < 0 then variables negatively correlated
* The covariance matrix element Cij is the covariance of xi and xj. The element Cii is the variance of xi.

In [226]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000243  0.000080  0.000131  0.000124
IBM   0.000080  0.000167  0.000092  0.000080
MSFT  0.000131  0.000092  0.000215  0.000146
GOOG  0.000124  0.000080  0.000146  0.000229

In [209]:
returns.corrwith(returns.IBM)

AAPL    0.397169
IBM     1.000000
MSFT    0.483709
GOOG    0.409794
dtype: float64

In [227]:
returns.corrwith(volume)

AAPL   -0.119463
IBM    -0.131717
MSFT   -0.086748
GOOG   -0.002151
dtype: float64

### Unique Values, Value Counts, and Membership
* series.unique()
* series.value_counts(), pd.value_counts(series, sort=False)
* series.isin(['b','c'])

In [211]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [212]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [213]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [214]:
pd.value_counts(obj.values, sort=False)

c    3
d    1
a    3
b    2
dtype: int64

In [252]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [253]:
mask = obj.isin(['b', 'c']) #each element in obj Series is in ['b', 'c']?
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [254]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

**Index.get_indexer** method, which gives you an index array
from an array of possibly non-distinct values into another array of distinct values:

In [216]:
# Based on unique_vals: index c-> 0, b-> 1, a-> 2, indexing to_match  
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a']) #[0, 2, 1, 1, 0, 2]
unique_vals = pd.Series(['c', 'b', 'a']) #index c-> 0, b-> 1, a-> 2 
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [255]:
#test
pd.Index(unique_vals)

Index(['c', 'b', 'a'], dtype='object')

In [217]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [218]:
#the row labels in the result are the distinct values occurring in all of the columns.

#in Qu1 column, element 1 frequency 1  -> index 1: 1.0, 
# element 3 frequency 2 -> index 3: 2.0
# element 4 frequency 2 -> index 4: 2.0, else -> fillna(0)
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Conclusion

In [256]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS